import 'dart:ui';

const backgroundcolor1 = 0xffFFFFFF;
const backgroundcolor2 = 0xff8DC245;
const backgroundcustomgreen = 0xff8DC245;
const String klogo = 'assets/logos/Logo Hezma.png';
const String kNextIcon = 'assets/images/Group 2.png';
const String kWhitelogo = 'assets/images/Rectangle 4.png';

const String kUnion = 'assets/images/Union.png';
const String kimgPg1 = 'assets/images/Vegetable-Transparent-PNG 1@2x.png';
const String ktext1Pg1 = 'assets/images/KesmKhdar.png';
const String ktxt2Pg1 = 'يعمل الماء على صحة الإنسان، وتخلصه من مرض السكري ';
const String ktxt3Pg1 =
    ' وخاصةً أنواع السكري الثاني.بالإضافة إلى إن لها دور فعال في الحفاظ على صحة الجسم';
const String ktextpri2 = '''
نحن في [حزمة ] نقدر خصوصيتك ونلتزم بحمايتها. توضح هذه السياسة كيف نقوم بجمع واستخدام ومشاركة وحماية المعلومات الشخصية التي نحصل عليها من مستخدمينا.

1. جمع المعلومات
نقوم بجمع أنواع مختلفة من المعلومات لتوفير وتحسين خدماتنا لك. قد تشمل هذه المعلومات:

المعلومات الشخصية: مثل الاسم، البريد الإلكتروني، رقم الهاتف، العنوان.
المعلومات التقنية: مثل عنوان IP، نوع المتصفح، صفحات الإحالة والخروج.
المعلومات الديموغرافية: مثل العمر، الجنس، الاهتمامات.

2. استخدام المعلومات
نستخدم المعلومات التي نجمعها للأغراض التالية:

تحسين خدماتنا وتخصيص تجربتك.
التواصل معك بشأن الحسابات، الخدمات، والعروض الترويجية.
تحليل استخدام الموقع وتحسين أداء الموقع.
الامتثال للمتطلبات القانونية والتنظيمية.

3. مشاركة المعلومات
نحن لا نشارك معلوماتك الشخصية مع أطراف ثالثة إلا في الحالات التالية:

بموافقتك الصريحة.
للامتثال للقوانين أو الاستجابة للإجراءات القانونية.
لحماية حقوقنا أو ممتلكاتنا أو سلامة مستخدمينا.
مع مقدمي الخدمات الذين يساعدوننا في تشغيل موقعنا أو أعمالنا.

4. حماية المعلومات
نحن نتخذ تدابير أمنية معقولة لحماية معلوماتك الشخصية من الوصول غير المصرح به أو التغيير أو الكشف أو الإتلاف. ومع ذلك، لا يمكننا ضمان الأمان المطلق للبيانات المرسلة عبر الإنترنت.

5. حقوقك
لديك حقوق معينة فيما يتعلق بمعلوماتك الشخصية، بما في ذلك الحق في الوصول إلى معلوماتك، وتصحيحها، وطلب حذفها. إذا كنت ترغب في ممارسة أي من هذه الحقوق، يرجى الاتصال بنا.

6. ملفات تعريف الارتباط
نستخدم ملفات تعريف الارتباط لتحسين تجربتك على موقعنا. يمكنك اختيار رفض ملفات تعريف الارتباط من خلال إعدادات المتصفح الخاص بك، ولكن قد يؤثر ذلك على قدرتك على استخدام بعض ميزات موقعنا.

7. تغييرات على سياسة الخصوصية
قد نقوم بتحديث سياسة الخصوصية هذه من وقت لآخر. سنقوم بإعلامك بأي تغييرات مهمة عن طريق نشر السياسة الجديدة على موقعنا مع تاريخ سريان محدث.

8. الاتصال بنا
إذا كان لديك أي أسئلة أو استفسارات حول سياسة الخصوصية هذه، يرجى الاتصال بنا عبر:

البريد الإلكتروني: [بريدك الإلكتروني]
الهاتف: [رقم هاتفك]
العنوان: [عنوان شركتك]
''';

const String kimgPg2 = 'assets/images/pngegg (33) 1.png';
const String ktext1Pg2 = 'assets/images/Kesmfakh.png';
const String Ktextpri =
    '''تُعتبر هذه الشروط والأحكام اتفاقية قانونية بين [حزمة ] ("نحن" أو "الشركة") وبينك ("المستخدم" أو "أنت"). بدخولك إلى موقعنا أو استخدام خدماتنا، فإنك توافق على الالتزام بهذه الشروط والأحكام.

1. الاستخدام المقبول

1.1 يجب أن يكون عمرك 18 عامًا أو أكثر لاستخدام هذا الموقع أو الخدمات.

1.2 يُحظر استخدام الموقع لأي غرض غير قانوني أو غير مصرح به.

1.3 يجب على المستخدمين توفير معلومات دقيقة وكاملة عند التسجيل واستخدام الموقع.

2. الحسابات والأمان

2.1 يتحمل المستخدم مسؤولية الحفاظ على سرية معلومات حسابه وكلمة المرور الخاصة به.

2.2 تحتفظ الشركة بالحق في تعليق أو إلغاء حسابك إذا تم اكتشاف أي نشاط مشبوه أو غير قانوني.

3. المحتوى

3.1 جميع المحتويات المقدمة على هذا الموقع، بما في ذلك النصوص والصور والشعارات، هي ملك للشركة أو مرخصة لها.

3.2 لا يجوز للمستخدمين إعادة إنتاج أو توزيع أو تعديل أي محتوى بدون إذن كتابي مسبق من الشركة.

4. سياسة الخصوصية

4.1 نلتزم بحماية خصوصيتك. يُرجى الرجوع إلى [رابط سياسة الخصوصية] لمزيد من المعلومات حول كيفية جمع واستخدام البيانات الشخصية.

5. إخلاء المسؤولية

5.1 يتم توفير الموقع والخدمات "كما هي" دون أي ضمانات من أي نوع.

5.2 لا نتحمل المسؤولية عن أي أضرار ناتجة عن استخدامك للموقع أو الخدمات.

6. التعديلات

6.1 تحتفظ الشركة بالحق في تعديل هذه الشروط والأحكام في أي وقت. سيتم إعلام المستخدمين بأي تغييرات كبيرة عبر البريد الإلكتروني أو من خلال إشعار على الموقع.

7. القانون المعمول به

7.1 تخضع هذه الشروط والأحكام وتُفسر وفقًا لقوانين [البلد أو الولاية].

8. الاتصال بنا

إذا كانت لديك أي أسئلة أو استفسارات بشأن هذه الشروط والأحكام، يُرجى الاتصال بنا عبر [البريد الإلكتروني] أو [رقم الهاتف].
'''
    '';
const String kimgPg3 = 'assets/images/00000.png';
const String ktext1Pg3 = 'assets/images/KesmMah.png';
TextStyle kStyle = TextStyle(
  fontSize: 20,
  fontWeight: FontWeight.bold,
  fontFamily: 'STVBold',
);
